# ConversionFailures Properties

---
The BuiltInFailuresConversionFailures type exposes the following members.
| Name| Description
---|---|---
| CannotConvertPercentToDouble|  Cannot convert concentration percent ' [Percentage Value] ' to double value
| CannotConvertTempToDouble|  Cannot convert temperature '[Temperate Value]' to double value
| CannotConvertToDouble|  Cannot convert '[Text] ' to double value
| UndefinedFluidUnit|  Undefined fluid unit: '[Fluid Unit Type Name]'
| UndefinedTemperatureUnit|  Undefined temperature unit: '[Temperature Unit Type Name]'
Top
#### Reference
BuiltInFailuresConversionFailures Class
Autodesk.Revit.DB Namespace